---
kind: type
id: T:Autodesk.Revit.DB.CADLinkOptions
source: html/a5d5d78c-cc65-c7a5-0bc8-4413156a2114.htm
---
# Autodesk.Revit.DB.CADLinkOptions

This class contains the options in use when
 or reloading a CAD link type (DWG, DXF, etc.)

## Syntax (C#)
```csharp
public class CADLinkOptions : IDisposable
```